app/views/users/_user.html.erb

SELECT COUNT(*) FROM "users"
---
  <td class="text-center" style="vertical-align: middle">
    <%= user.followed_users.count %>