app/views/users/show.html.erb

SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = $1 ORDER BY created_at DESC LIMIT 1  [["user_id", 104]]
---
    <%= render 'follow_form' if signed_in? %>
    <% if @user.microposts.any? %>