app/controllers/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = 'b4f1f8a7039760671bc1a0da7244c49808f4e537' LIMIT 1
---
  def edit
    @user = User.find_by_password_reset_token!(params[:id])

SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = '53649ceebd36138c4e0592a3087b8143e8d2f860' LIMIT 1
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = 132  [["password_digest", "$2a$10$uuUUAfunVktWUJWE8RQ16.gKuZzQ2kAO1/lKoHGh8pNJRvFLOcDTS"], ["updated_at", Sat, 22 Feb 2014 09:31:31 UTC +00:00]]
---
  def update
    @user = User.find_by_password_reset_token!(params[:id])
    if @user.password_reset_sent_at < 2.hours.ago
      redirect_to new_password_reset_path, alert: 'Password reset has expired.'
    #elsif @user.update_attributes(params[:user])
    elsif @user.update_attributes(params.require(:user).permit(:password, :password_confirmation))