app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'jakehockey10@gmail.com' LIMIT 1
---
  def create
    @user = User.find_by(email: params[:session][:email])