app/controllers/users_controller.rb

  def index
    @q = User.ransack(params[:q])
    @users = @q.result.paginate(page: params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    redirect_to_root_if_signed_in

    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "state", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def verify_emails
    @user = User.find_by(email_token: params[:email_token])
---
SELECT "users".* FROM "users" WHERE "users"."email_token" = 'a8fe48e9de7a335ecc32e218265aa0b1afb27175' LIMIT 1